# SetRodStructureExtension Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricationRodInfo..::..SetRodStructureExtension Method
FabricationRodInfo Class See Also
---
Set the length of the rod's top extension into structure. The rod must be attached to structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool SetRodStructureExtension(
	int rodIndex,
	double extension
)
```

Visual Basic
---
```text
Public Function SetRodStructureExtension ( _
	rodIndex As Integer, _
	extension As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool SetRodStructureExtension(
	int rodIndex,
	double extension
)
```

# ### Parameters
rodIndex
    Type: System..::..Int32 The rod index.
extension
    Type: System..::..Double Distance the rod will extend into the structure.
# ### Return Value
returns true if it worked.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | the index rodIndex is should be in range of rod count. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The rods do not attached to any structue. |

# See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace